backend/app/controllers/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" IN (?, ?, ?, ?, ?, ?)  [[nil, 1], [nil, 5], [nil, 6], [nil, 3], [nil, 4], [nil, 2]]
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def index
        departments = Department.all.includes(:users)