backend/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" INNER JOIN "tasks" ON "users"."id" = "tasks"."user_id" WHERE "tasks"."project_id" = ?  [["project_id", 1]]
---
    def index
        projects = Project.all.includes(:users, :tasks, :creator)

INSERT INTO "projects" ("name", "creator_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Jomazon Prime"], ["creator_id", 1], ["created_at", "2021-02-12 16:28:24.648042"], ["updated_at", "2021-02-12 16:28:24.648042"]]
---
    def create
        project = Project.new(project_params)

        if project.save