backend/app/controllers/tasks_controller.rb

    def index
        tasks = Task.all.includes(:user, :project)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" INNER JOIN "tasks" ON "users"."id" = "tasks"."user_id" WHERE "tasks"."project_id" = ?  [["project_id", 1]]