backend/app/controllers/users_controller.rb

    def index
        users = User.all.includes(:projects, :tasks, :department)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" IN (?, ?, ?, ?, ?, ?)  [[nil, 1], [nil, 5], [nil, 6], [nil, 3], [nil, 4], [nil, 2]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" INNER JOIN "tasks" ON "users"."id" = "tasks"."user_id" WHERE "tasks"."project_id" = ?  [["project_id", 1]]